# 1) შექმენით სია, რომელსაც შეინახავთ ცვლადში სახელად friends. მაგ სიაში უნდა შეინახოთ მინიმუმ 5 მეგობრის სახელი. 
# პირველ რიგში გამოიტანეთ თქვენი საუკეთესო მეგობრის სახელი ინდექსების დახმარებით. დაბეჭდეთ სია. 
# შეცვლაეთ მე-3 ინდექსზე მყოფი სახელი ახალით და დაბეჭდეთ სია. საბოლოოდ დაბეჭდეთ მთლიანი სიის სიგრძე

# 1. შექმენით სია
friends = ["gio",  "luka", "nika", "mari", "mate"]
# # 2. თქვენი საუკეთესო მეგობრის სახელი გამოიტანეთ
print(friends[1])
# 3. დაბეჭდეთ სია
print(friends)
# 4. შეცვალეთ მე-3 ინდექსზე მყოფი სახელი
friends[3] = "kato"

print (friends)
# 5. დაბეჭდეთ სიის სიგრძე
print(len(friends))

# 2) შექმენით მანქანების სია, სადაც გამოიყენებთ ერთ-ერთ ფუნქციას, რომ სიაში დაამატოთ ახალი მანქანა.
# მანქნების სია
cars = ["volvo", "bmw", "lexus", "toyota"]
# ვამატებ სიაში მანქანას
cars.append("volkswagen")
print (cars)

# 3) შექმენით რიცხვების სია სადაც გექნებათ მინიმუმ ხუთი რიცხვი. შეცვლაეთ 
# ამ სიის პირველი ელემენტი და გაუტოლეთ ის 50-ს. შემდეგ კი გამოიტანეთ სიიდან პირველი
#  და ბოლო რიცხვის ჯამი

# შევქმნათ რიცხვების სია
num_list = [1, 5, 7, 33, 9]

# შევცვალოთ პირველი მნიშვნელობა
num_list[0] = 55
# შევქმნათ ცვლადი სადაც ვაჯამებთ
sum_of_number = num_list[0] + num_list[4]
print (sum_of_number)
