# # შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური რიცხვის ჯამს 1-იდან 50-მდე

# sum_numbers = 0

# num = 1
# while num <= 50:
#     sum_numbers += num 
#     num += 1
#     print (sum_numbers)


# # შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) მანამდე სანამ არ შეიყვანს 1234-ს
# password = ""
# while password !=("1234"):
#     password = input("type your passsword: ")
    
# # შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება რიცხვს 1-დან 10-მდე, 
# # სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს
# guess = ""
# while guess != ("5"):
#     guess = input (" guess my number: ")



# # while: გამოიყენება ციკლის დასაწყებად, როდესაც არა ცნობილი, რამდენჯერ უნდა შესრულდეს და პირობა იცვლება ციკლის შიგნიტ.
# # for: გამოიყენება მაშინ, როდესაც ვიცით ზუსტად რამდენჯერ უნდა შესრულდეს ციკლი ან როცა ვმუშაობთ განმეორებად მონაცემებზე.





