# +
print(3+3)
print(3+5)
print(88+3)
print(77+8)
print(55+81)

# -
print(8-8)
print(8-7)
print(42-66)
print(22-4)
print(8-44)

# *
print(5*5)
print(5*8)
print(44*10)
print(5*4)
print(5*10)


# /
print(30/5)
print(100/5)
print(30/2)
print(30/4)
print(30/8)


# My Family's age
mom_age = 56
dad_age = 56
sister_age = 32
granma_age = 78
granpa_age = 82
my_age = 16
result = (mom_age + dad_age + sister_age + granma_age + granpa_age + my_age)
print(result)



# დროებითი მეხსიერება გვჭირდება მაგისთვის რომ დროებით შევინახოთ რაიმე ინფორმაცია და მივიღოთ რაიმე შედეგი,
#  რის მერეც ეგ დროებითი ინფორმაცია აღარ გვჭირდება.

# bug არის რაღაც დაშვებული შეცდომა კოდის დაწერისას, debugging კი არის მაგ შეცდომების მოძებნის და გასწორების პროცესსი



# 1user > ("levana")
# ჯერ ერთი ცვლადის სახელს ვერ დავარქმევთ თუ დავიწყებთ რიცხვით ან ციფრით, ყოველტვის ვიწყებტ ასოთი(სიმბოლოთი)
# ჯერ მეორე ცვლადს რამე მნიშვნელობა რომ მივანიწოთ უნდა გამოვიყენოტ მხოლოდ = (ტოლია) ნიშანი
user_1 = ("levana")  # ასეა სწორი       
